export default function PrivacyPolicy() {
    return (
        <div className="bg-white p-8">
            <div className="max-w-4xl mx-auto">
                <h1 className="text-4xl font-bold text-center mb-8">Политика конфиденциальности</h1>

                <div className="text-lg text-gray-700 space-y-6">
                    <p>
                        Настоящая Политика конфиденциальности описывает, как мы собираем, используем и защищаем ваши личные данные при использовании нашего сайта. Мы стремимся обеспечить безопасность и конфиденциальность вашей информации и обязуемся соблюдать применимые законы и нормативные акты.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">1. Сбор и использование информации</h2>
                    <p>
                        Мы можем собирать различные виды информации, включая ваше имя, адрес электронной почты, номер телефона и другую контактную информацию, когда вы регистрируетесь на нашем сайте, оформляете заказ или заполняете формы на нашем сайте.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">2. Использование файлов cookie</h2>
                    <p>
                        Мы используем файлы cookie для улучшения работы нашего сайта и предоставления персонализированных услуг. Файлы cookie позволяют нам запоминать ваши предпочтения и анализировать вашу активность на сайте.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">3. Защита данных</h2>
                    <p>
                        Мы принимаем соответствующие меры безопасности для защиты ваших личных данных от несанкционированного доступа, изменения или раскрытия. Ваша конфиденциальность важна для нас, и мы стремимся обеспечить безопасность ваших данных.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">4. Передача данных третьим лицам</h2>
                    <p>
                        Мы не передаем ваши личные данные третьим лицам, за исключением случаев, предусмотренных законом или необходимых для выполнения наших обязательств перед вами.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">5. Ваши права</h2>
                    <p>
                        Вы имеете право на доступ к своим личным данным, их изменение или удаление. Если у вас есть какие-либо вопросы или запросы, свяжитесь с нами по контактной информации, указанной на нашем сайте.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">6. Изменения в Политике конфиденциальности</h2>
                    <p>
                        Мы оставляем за собой право вносить изменения в данную Политику конфиденциальности. Изменения вступают в силу с момента их публикации на нашем сайте. Мы рекомендуем регулярно проверять эту страницу для получения актуальной информации.
                    </p>

                    <h2 className="text-2xl font-bold mt-8">Контакты</h2>
                    <p>
                        Если у вас есть вопросы или предложения по поводу нашей Политики конфиденциальности, пожалуйста, свяжитесь с нами по следующему адресу: <br/>
                        Адрес: г. Астана, Тәуелсіздік даңғылы, 1Г <br/>
                        Телефон: +7 (705) 821-39-27 <br/>
                        Электронная почта: info@nazdar.kz
                    </p>
                </div>
            </div>
        </div>
    );
}